In [3]:
import pandas as pd
data=[1,2,3,4,5]
s=pd.Series(data)
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
data={'a':1,'b':2,'c':3}
s=pd.Series(data)
print(s)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[10,20,30]
index=['a','b','c']
join=pd.Series(data,index=index)
print(join)

a    10
b    20
c    30
dtype: int64

In [9]:
data={'Name':['ankit','Rohan','Sourav'],
       'Age':[24,23,23],
       'City':['Banglore','hubli','jaipur']}
tb=pd.DataFrame(data)
print(tb)
print(type(tb))

     Name  Age      City
0   ankit   24  Banglore
1   Rohan   23     hubli
2  Sourav   23    jaipur
<class 'pandas.core.frame.DataFrame'>

In [4]:
data=[{'Name':'Ankit','Age':23,'City':'Banglore'},
    {'Name':'Yadav','Age':22,'City':'Hyderabad'},
    {'Name':'Rao','Age':20,'City':'Pune'}]
dt=pd.DataFrame(data)
print(dt)

    Name  Age       City
0  Ankit   23   Banglore
1  Yadav   22  Hyderabad
2    Rao   20       Pune

In [8]:
dt.loc[0]

Name       Ankit
Age           23
City    Banglore
Name: 0, dtype: object

In [10]:
dt.iloc[0][0]

C:\Users\ankit\AppData\Local\Temp\ipykernel_14228\789417387.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  dt.iloc[0][0]

'Ankit'

In [14]:
dt.head(2)
dt.tail(2)

    Name  Age       City
1  Yadav   22  Hyderabad
2    Rao   20       Pune

In [23]:
dt['Salary']=[5000000,6000000,5054000]
print(dt)

    Name  Age       City   Salary
0  Ankit   23   Banglore  5000000
1  Yadav   22  Hyderabad  6000000
2    Rao   20       Pune  5054000

In [24]:
dt.drop('Salary',axis=1,inplace=True)
print(dt)

    Name  Age       City
0  Ankit   23   Banglore
1  Yadav   22  Hyderabad
2    Rao   20       Pune

In [25]:
dt['Age']=dt['Age']+1
print(dt)

    Name  Age       City
0  Ankit   24   Banglore
1  Yadav   23  Hyderabad
2    Rao   21       Pune